DataProcessors/НачальнаяСтраницаЮристы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>НачальнаяСтраницаЮристы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Должники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРасчетногоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСсудногоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФинансирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЕжемесячногоПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЕжемесячногоПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКредита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКредитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЕжемесячногоПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЕжемесячногоПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозникновенияДолга</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкПервоначальныйКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/НачальнаяСтраницаЮристы/Forms/ФормаПоиск/Ext/Form/Module.bsl
&НаКлиенте
Процедура БанкМногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
     СтандартнаяОбработка=Ложь;
	 ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораБанки",ЭтаФорма);

	 ОткрытьФорму("Справочник.Банки.Форма.ФормаВыбораМного",,ЭтаФорма,,,,ОповещениеОЗакрытии); 
	
	

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Банк", МногоБанков.ВыгрузитьЗначения());
	
	
	
	СписокПараметров.Вставить("НомерДоговораЦессии", НомерДоговораЦессии);
	
	СписокПараметров.Вставить("ДатаЦессииОт", НачалоДатаЦессии);
	
	СписокПараметров.Вставить("ДатаЦессииДо", ДатаЦессииКонец);
	
	СписокПараметров.Вставить("ФИОДолжника", ФИОДолжника);
	
	СписокПараметров.Вставить("ДоговораМ", МногоДоговоров);
	
	СписокПараметров.Вставить("НетИсполнителя", НетИсполнителя);
	
	СписокПараметров.Вставить("ШифрДокумента", ШифрДокумента);
	
	
	
	СписокПараметров.Вставить("ОтменаПоиска", СброситьФильтр);
	
	
	
	
	
	
	
	ОповеститьОВыборе(СписокПараметров);
	
КонецПроцедуры


&НаКлиенте
Процедура НайтиДанные(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	  Банк=Параметры.Банк;
	
	
КонецПроцедуры



&НаКлиенте
Процедура НомерДоговораЦессииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	
	ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбора",ЭтаФорма); 

	ОткрытьФорму("Справочник.ДоговорЦессии.Форма.ФормаВыбора",,ЭтаФорма,,,,ОповещениеОЗакрытии);
	
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура ДанныеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
		  Иначе
			  
			НомерДоговораЦессии=РезультатЗакрытия.НомерДоговора;			  
			  
			  
		 КонецЕсли;  
		  
	

КонецПроцедуры

&НаКлиенте
Процедура НомерКДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	         ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеВыбораКД",ЭтаФорма);
			 
			ОткрытьФорму("Справочник.Договоры.Форма.ФормаВыбораДогДолж",,ЭтаФорма,,,,ОповещениеОЗакрытии); 
	
	
КонецПроцедуры
		

&НаКлиенте
Процедура ДанныеВыбораКД(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
		  Иначе
			  
			  массивДоговора=РезультатЗакрытия;
			  
			 МногоДоговоров.ЗагрузитьЗначения(массивДоговора);
			 
			 строкаМногоДоговоров="";
			  Для каждого стр Из массивДоговора  Цикл
				  
				  строкаМногоДоговоров=строкаМногоДоговоров+стр.НомерДоговора+" ";
				  
			  	
			  
			  КонецЦикла;		

			  
			  НомерКД=строкаМногоДоговоров;
			  
						  
		 КонецЕсли;  
		  
	

КонецПроцедуры



&НаКлиенте
Процедура ДанныеВыбораБанки(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	
	
		 Если РезультатЗакрытия= Неопределено Тогда
		      Возврат;
		
		  Иначе
			  
			  массивБанк=РезультатЗакрытия.Банкимассив;
			  
			  МногоБанков.ЗагрузитьЗначения(массивБанк);
			  
			   строкаМногоБанков="";
			  Для каждого стр Из массивБанк  Цикл
				  
				  строкаМногоБанков=строкаМногоБанков+Строка(стр)+" ";
				  
			  	
			  
			  КонецЦикла;		
			   
			    БанкМного=строкаМногоБанков;
			  
			  
			  
		 КонецЕсли;  
		  
	

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоиск(Команда)
	
	СброситьФильтр=Истина;
	
	ЭтаФорма.Закрыть();
	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеВходящегоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	    ОповещениеОЗакрытии=Новый ОписаниеОповещения("ДанныеДляПоискаПоВходящим",ЭтотОбъект); 
		
		ОткрытьФорму("Обработка.НачальнаяСтраницаЮристы.Форма.ФормаНаименованиеВходящиеДокументы",,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
	
КонецПроцедуры


&НаКлиенте
Процедура ДанныеДляПоискаПоВходящим(РезультатЗакрытия,ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия= Неопределено Тогда
	     Возврат;
		
	
	Иначе
        
		  
		  НаименованиеВходящегоДокумента=РезультатЗакрытия.НаименованиеДокумента;
		  ШифрДокумента= РезультатЗакрытия.ШифрДокумента;
		  
		
	КонецЕсли; 	
	
КонецПроцедуры
